Member Funciton
===============

> How easy would it be for us to implement it ourselves. 

Base case: is it null? Otherwise, is it in the car of the list, then you
return the list itself. Otherwise, you run the function on the cdr of l. 

	(define (member X L)
		(cond 
		  ((null? L) #f)
		  ((equal? X (car L)) L)
		  (#t (member L (car L)))))

	> (define s (list 'cadr ''(one two three)))
	> s
	(cadr '(one two three))
	> (eval s)
	two


Lambda calculus
===============
* The *define* special form creates a 


* A *lambda expression* is a list of the symbol *lambda*, followed by a
  list of *parameters*, followed by a *body* of one or more expressions. 
  
* `((lambda (x) (+ x 2)) 100)` is an important form to know. Evaluating
  functions without actually defining them! O.o 
  
Define
======

	(define (add2 x) (+x 2))

Equivilent to a lambda form with an x as it's only parameter. More
conveninet than: 

	(define add2 (lambda (x) (+ x 2 )))

Another form: 

	(define add2 #f)
	(set! add2 (lambda (x) (+ x 2)))
	
Mapping functions
=================

**Map** takes a function and â‰¥ 1 lists and returns a list of the results
of applying the function to elements taken from each list. For
instance: 
	
	> (map abs '(3 -4 2 -5 -6))
	  (3 4 2 5 6)
	> (map + '(1 2 3) '(4 5 6))
	  (5 7 9)
	> (map + '(1 2 3) '(4 5 6) '(7 8 9))
	  (12 15 18)
		
More map examples: 
------------------

	> (map cons '(a b c) '(1 2 3))
	  ((a . 1) (b . 2) (c . 3))
	
	> (map (lambda (x) (+ x 10)) '(1 2 3))
	  (11 12 13)
	
	> (map + '(1 2 3) '(4 5))
**DOES NOT WORK**

Filter function
---------------

Returns elements of a list that meet a given criteria. 

	> (filter (odd?) '(1 2 3 4 5))
	  (1 3 5)
	  
Homework
========

1. Chop and Unchop

   Chop takes off the last thing in a list. 
   
				
2. `shift-left` and `shift-right`

3. `zipper`: Proper list where each element is a list with exactly two
   elements which can be any expressions. 
